onvif_ptz_explorer/xml/17_relative_move.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
  <s:Header>{AUTH_HEADER}</s:Header>
  <s:Body>
    <RelativeMove xmlns="http://www.onvif.org/ver20/ptz/wsdl">
      <ProfileToken>{PROFILE_TOKEN}</ProfileToken>
      <Translation>
        <PanTilt x="{PAN}" y="{TILT}" xmlns="http://www.onvif.org/ver10/schema"/>
        <Zoom x="{ZOOM}" xmlns="http://www.onvif.org/ver10/schema"/>
      </Translation>
      <Speed>
        <PanTilt x="0.5" y="0.5" xmlns="http://www.onvif.org/ver10/schema"/>
        <Zoom x="0.5" xmlns="http://www.onvif.org/ver10/schema"/>
      </Speed>
    </RelativeMove>
  </s:Body>
</s:Envelope>
